Repository: brunoknop/CashFlow
Catalog: src/CashFlow.Exception/ResourceErrorMessages.*.resx
Languages: pt_br

# AMOUNT_MUST_BE_GREATER_THAN_ZERO
source: The amount must be greater than zero
pt_br: O Valor deve ser maior que zero

source: Expenses cannot be for the future
pt_br: A despesa não pode ser para o futuro

# PAYMENT_TYPE_IS_INVALID
source: The payment type is invalid
pt_br: Tipo de pagamento inválido

# TITLE_REQUIRED
source: Title is required
pt_br: O título é obrigatório

source: Unknow error
pt_br: Erro desconhecido

# EXPENSE_NOT_FOUND
source: The expense is not found
pt_br: A despesa não foi encontrada

# NAME_EMPTY
source: The name cannot be empty
pt_br: O nome não pode ser vazio

# EMAIL_EMPTY
source: The e-mail cannot be empty
pt_br: O e-mail não pode ser vazio

# EMAIL_INVALID
source: The e-mail is invalid
pt_br: O e-mail é inválido

# INVALID_PASSWORD
source: The password must be at least 8 characters long and include uppercase and lowercase letters, numbers and symbols.
pt_br: A senha deve ter pelo menos 8 caracteres e incluir letra maiúscula, minuscula, numero e símbolo

# EMAIL_EXISTS
source: The e-mail aready used in an active account
pt_br: O e-mail já é usado em uma conta ativa.

# EMAIL_OR_PASSWORD_INVALID
source: The e-mail and the password are incorrects
pt_br: O e-mail e a senha estão incorretos

# INVALID_TOKEN
source: The token is invalid.
pt_br: O token é inválido

# EXPENSES_NOT_FOUND_FOR_THE_PERIOD
source: Expenses not found for the desired period
pt_br: Despesas não encontradas para o período desejado

# PASSWORD_DIFFERENT_CURRENT_PASSWORD
source: The password is different from the current password
pt_br: A senha é diferente da senha atual

# NEW_PASSWORD_SAME_AS_CURRENT_PASSWORD
source: The new password is the same as the current password
pt_br: A nova senha é igual a senha atual

# TAG_TYPE_NOT_SUPPORTED
source: Tag not supported
pt_br: Tag não suportada
